In [42]:
latest_nav_path = "dailyNAV/NAVAll_2025-06-27.txt"

In [43]:
import pandas as pd
import numpy as np
df = pd.read_csv(latest_nav_path , delimiter=";")[["Scheme Code" , "Scheme Name", "Net Asset Value" , "Date"]]
df.sample(3)

,Scheme Code,Scheme Name,Net Asset Value,Date
13449,123212,Reliance Fixed Horizon Fund - XXIV - Series 7 ...,10.0000,02-Sep-2016
9745,147825,Axis Retirement Fund - Aggressive Plan - Direc...,20.44,26-Jun-2025
5520,152920,LIC MF Manufacturing Fund-Direct Plan-Growth,10.0272,26-Jun-2025

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15171 entries, 0 to 15170
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Scheme Code      15171 non-null  object
 1   Scheme Name      14112 non-null  object
 2   Net Asset Value  14112 non-null  object
 3   Date             14112 non-null  object
dtypes: object(4)
memory usage: 474.2+ KB

In [45]:
df = df.drop(df[~df["Scheme Code"].apply(lambda x : x.isdigit())].index)
df.head(3)

,Scheme Code,Scheme Name,Net Asset Value,Date
2,119551,Aditya Birla Sun Life Banking & PSU Debt Fund ...,107.5011,26-Jun-2025
3,119552,Aditya Birla Sun Life Banking & PSU Debt Fund ...,118.0124,26-Jun-2025
4,119553,Aditya Birla Sun Life Banking & PSU Debt Fund ...,104.6736,26-Jun-2025

In [46]:
df["Scheme Code"] = df["Scheme Code"].astype(int)
df["Net Asset Value"] = df["Net Asset Value"].replace("N.A." , np.nan).astype(np.float64)
df["Date"] = pd.to_datetime(df["Date"])

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 14112 entries, 2 to 15170
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Scheme Code      14112 non-null  int32
 1   Scheme Name      14112 non-null  object
 2   Net Asset Value  14106 non-null  float64
 3   Date             14112 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int32(1), object(1)
memory usage: 496.1+ KB

In [48]:
df.sample(2)

,Scheme Code,Scheme Name,Net Asset Value,Date
2987,147600,PGIM India Overnight Fund - Regular Plan- Grow...,1329.8240,2025-06-26
8079,116632,Franklin U.S. Opportunities Equity Active Fund...,75.0552,2025-06-26

In [49]:
df = df[df["Date"].dt.date == pd.Timestamp.today().date() - pd.Timedelta(days=4)]
df.sample(2)

,Scheme Code,Scheme Name,Net Asset Value,Date
5540,148621,Mirae Asset Banking and Financial Services Fun...,20.9630,2025-06-26
3067,120511,Axis Short Duration Fund - Direct Plan - Month...,10.0906,2025-06-26

In [55]:
nav_series = "Historical_nav/nav_time_series2.csv"
nav_time_series = pd.read_csv(nav_series)
nav_time_series["Date"] = pd.to_datetime(nav_time_series["Date"])
nav_time_series["Scheme Code"] = nav_time_series["Scheme Code"].map(int)
nav_time_series.sample(3)

C:\Users\vaibh\AppData\Local\Temp\ipykernel_21968\2924199640.py:2: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  nav_time_series = pd.read_csv(nav_series)

,Scheme Code,Scheme Name,ISIN Div Payout/ISIN Growth,ISIN Div Reinvestment,Net Asset Value,Date
595633,105805,Aditya Birla Sun Life Small Cap Fund -Regular ...,INF209K01EO0,INF209K01EP7,26.6132,2022-03-04
6148653,148290,NIPPON INDIA STRATEGIC DEBT FUND - SEGREGATED...,INF204KB12R7,INF204KB13R5,0.0000,2021-02-16
1122975,145774,Aditya Birla Sun Life Fixed Term Plan - Series...,INF209KB1B20,NaN,12.2855,2020-12-30

In [56]:
nav_time_series.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9609323 entries, 0 to 9609322
Data columns (total 6 columns):
 #   Column                       Dtype
---  ------                       -----
 0   Scheme Code                  int64
 1   Scheme Name                  object
 2   ISIN Div Payout/ISIN Growth  object
 3   ISIN Div Reinvestment        object
 4   Net Asset Value              float64
 5   Date                         datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 439.9+ MB

In [57]:
# Pivot NAVs: rows = dates, columns = scheme codes
nav_wide = nav_time_series.pivot(index='Date', columns='Scheme Code', values='Net Asset Value').sort_index()

In [58]:
nav_wide = nav_wide.ffill()
nav_wide.sample(3)

Scheme Code,100033,100034,100037,100038,100041,100042,100043,100044,100046,100047,...,153598,153599,153600,153601,153608,153618,153634,153635,153636,153637
Date,,,,,,,,,,,,,,,,,,,,,
2025-03-06,791.51,122.76,13.3546,121.6639,108.023,667.8672,685.3699,163.694,100.195,411.5543,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2022-02-02,684.30,130.34,13.3979,101.4304,108.023,549.2017,563.5946,163.694,100.195,338.4313,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2023-12-22,750.89,124.99,13.0216,111.0855,108.023,613.3346,629.4082,163.694,100.195,377.9509,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [61]:
pivot_df = df.pivot(index='Date', columns='Scheme Code', values='Net Asset Value')
latest_schemes = set(map(int,pivot_df.columns))
old_schemes = set(map(int,nav_wide.columns))
new_schemes = latest_schemes - old_schemes
missing_schemes = old_schemes - latest_schemes
total_schemes = len(new_schemes) + len(old_schemes)
print(len(new_schemes) ,"\n", len(missing_schemes) , "\n" , total_schemes)

355
 5300
 13488

In [64]:
len(pivot_df) , len(pivot_df.columns)

(1, 8188)

In [62]:
nav_wide2 = pd.concat( [nav_wide , pivot_df])
np.isnan(nav_wide2.iloc[-1]).sum()/len(nav_wide2.columns)

0.3929418742586002

In [63]:
len(nav_wide.columns) , len(nav_wide2.columns)

(13133, 13488)

In [65]:
nav_wide2 = nav_wide2.ffill()
np.isnan(nav_wide2[-2:].ffill().iloc[-1]).sum()/len(nav_wide2.columns)

0.0

In [69]:
nav_wide2.iloc[-2:] = nav_wide2.iloc[-2:].ffill()
nav_wide2 = nav_wide2.drop(nav_wide2.index[-2])

In [71]:
updated_history = "nav_time_series_updated.csv"
nav_wide2.to_csv(updated_history)

In [70]:
nav_wide2.iloc[-2:]

Scheme Code,100033,100034,100037,100038,100041,100042,100043,100044,100046,100047,...,152890,153096,153097,153264,153265,153403,153404,153405,153517,153518
Date,,,,,,,,,,,,,,,,,,,,,
2025-06-24,899.39,139.49,13.3537,125.6128,108.023,682.1731,700.0508,163.694,100.195,420.3698,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2025-06-25,906.52,140.60,13.3354,125.4406,108.023,682.2363,700.1156,163.694,100.195,420.4088,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN